Autodesk.Revit.DB.FabricationConnectorInfo.IsDoubleWallConnectorLocked
Fabrication double wall connector lock.
Remarks:
If set this prevents the connector value being overridden by the fabrication specification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No double wall connector available.
-or-
When setting this property:
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.DoubleWallConnectorId
Fabrication double wall connector Id.
Remarks:
A reference to the fabrication configuration connectors.
Setting the connector value will also set the connector lock.
A value of 0 indicates no connector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No double wall connector available.
-or-
When setting this property:
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.IsBodyConnectorLocked
Fabrication body connector lock.
Remarks:
If set this prevents the connector value being overridden by the fabrication specification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.BodyConnectorId
Fabrication body connector Id.
Remarks:
A reference to the fabrication configuration connectors.
Setting the connector value will also set the connector lock.
A value of 0 indicates the connector is set to none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2016